PaaS-SaaS_UIAccelerator/UIAcceleratorExtended/OSCProxyClient/src/com/oracle/ptsdemo/oscproxyclient/custom/SOAP_payload_find_CLOSED_WON_opty_by_SalesParty.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/sales/opptyMgmt/opportunities/opportunityService/types/" xmlns:typ1="http://xmlns.oracle.com/adf/svc/types/">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:findOpportunity>
         <typ:findCriteria>
            <typ1:fetchStart>0</typ1:fetchStart>
            <typ1:fetchSize>-1</typ1:fetchSize>
            <typ1:filter>
			<typ1:conjunction>And</typ1:conjunction>
               <typ1:group>
                 <typ1:conjunction>And</typ1:conjunction>
                  <typ1:upperCaseCompare>false</typ1:upperCaseCompare>
                  <typ1:item>
                  	 <typ1:conjunction>And</typ1:conjunction>
                     <typ1:upperCaseCompare>false</typ1:upperCaseCompare>
                     <typ1:attribute>PartyUniqueName</typ1:attribute>
                     <typ1:operator>STARTSWITH</typ1:operator>
                     <typ1:value>Allianze Group</typ1:value>
                  </typ1:item>     
                  <typ1:item>
                  	 <typ1:conjunction>And</typ1:conjunction>
                     <typ1:upperCaseCompare>false</typ1:upperCaseCompare>
                     <typ1:attribute>StageStatusCd</typ1:attribute>
                     <typ1:operator>=</typ1:operator>
                     <typ1:value>WON</typ1:value>
                  </typ1:item>                              
               </typ1:group>
               
            </typ1:filter>

		  <typ1:findAttribute>PartyUniqueName</typ1:findAttribute>
            <typ1:findAttribute>Name</typ1:findAttribute>
            <typ1:findAttribute>OptyId</typ1:findAttribute>
            <typ1:findAttribute>Revenue</typ1:findAttribute>            
            <typ1:findAttribute>OptyCreationDate</typ1:findAttribute>            
            <typ1:findAttribute>OptyLastUpdateDate</typ1:findAttribute>            



            <typ1:sortOrder>
                  <typ1:sortAttribute>
                     <typ1:name>PartyUniqueName</typ1:name>
                     <typ1:descending>false</typ1:descending>
                  </typ1:sortAttribute>
                  <typ1:sortAttribute>
                     <typ1:name>OptyLastUpdateDate</typ1:name>
                     <typ1:descending>true</typ1:descending>
                  </typ1:sortAttribute>
               </typ1:sortOrder>
               
      
                      
            <typ1:excludeAttribute>false</typ1:excludeAttribute>
         </typ:findCriteria>
         <typ:findControl>
            <typ1:retrieveAllTranslations>false</typ1:retrieveAllTranslations>
         </typ:findControl>
      </typ:findOpportunity>
   </soapenv:Body>
</soapenv:Envelope>